# from dictionary

In [12]:
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]} 
data

{'country': ['india', 'uk', 'austria', 'us'], 'GDP': [123, 345, 678, 2134]}

In [13]:
import pandas as pd
df=pd.DataFrame(data)
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

## to add missing value-explicity-np.nan

In [14]:
import numpy as np

In [5]:
data={"country":["india","uk","austria","us",np.nan],"GDP":[123,345,678,np.nan,2134]} 
data

{'country': ['india', 'uk', 'austria', 'us', nan],
 'GDP': [123, 345, 678, nan, 2134]}

In [6]:
d={"name":["piya","riya","asshi","meera"],"age":['20','30','60','23'],\
   "height":[120.3,152.4,155,162],"gender":["f","f","m","f"]}  ## \ is used to break the lines
df=pd.DataFrame(d)   ##keys of dict are columns
df

    name age  height gender
0   piya  20   120.3      f
1   riya  30   152.4      f
2  asshi  60   155.0      m
3  meera  23   162.0      f

### homework - task1-take a string from the user ex-madrid then d should be like this d={0:'m',1:'a',----}
### task2- ascii value of m should be its key

### make a dataframe, take entry and col from user and save all that data in dict

In [1]:
d={}
inp=input("enter the string")
key=0
for i in inp:
    d[key]=i
    key=key+1
print(d)

enter the stringmadrid
{0: 'm', 1: 'a', 2: 'd', 3: 'r', 4: 'i', 5: 'd'}

In [5]:
d={}
inp=input("enter the string")
#key=0
for i in inp:
    key=i
    asc=ord(key)
    d[asc]=i
    #key=key+1
print(d)
#d is not present at the end bcz keys are unique

enter the stringmadrid
{109: 'm', 97: 'a', 100: 'd', 114: 'r', 105: 'i'}

In [1]:
##student question

In [16]:
'''d={}
st=input("enter the student name--").split(" ")
cou=input("enter the course name--").split(" ")
for i in st:
    for j in cou:
        key=j
        d[key]=i
#-thomas rupanshi louis virat zayn acting maths music cricket vocals      
print(d)'''

enter the student name--acting maths music cricket vocals
enter the course name--thomas rupanshi louis virat zayn
{'thomas': 'vocals', 'rupanshi': 'vocals', 'louis': 'vocals', 'virat': 'vocals', 'zayn': 'vocals'}

In [4]:
d={}
inp=int(input("how many times---"))
for i in range(inp+1):
    st=input("enter the student name--")
    cou=input("enter the course name--")
    key=st
    d[key]=cou
#-thomas rupanshi louis virat zayn acting maths music cricket vocals      
print(d)

how many times---4
enter the student name--thomas
enter the course name--acting
enter the student name--rupanshi
enter the course name--maths
enter the student name--louis
enter the course name--music
enter the student name--virat
enter the course name--cricket
enter the student name--zayn
enter the course name--vocals
{'thomas': 'acting', 'rupanshi': 'maths', 'louis': 'music', 'virat': 'cricket', 'zayn': 'vocals'}

## checking the column types-imp

In [7]:
df.dtypes

name       object
age        object
height    float64
gender     object
dtype: object

## any textual data(string) is object in pandas

## astype()-to change data type

In [8]:
df["age"]=df["age"].astype(int) ## since age is in object to convert it into int use astype

In [10]:
df.dtypes

name       object
age         int32
height    float64
gender     object
dtype: object

In [11]:
df["age"].dtype ### to check type of particular column

dtype('int32')

### info()- tells col,memory size

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int32
 2   height  4 non-null      float64
 3   gender  4 non-null      object
dtypes: float64(1), int32(1), object(2)
memory usage: 240.0+ bytes

## memory changes according to data type

# create the data frame from list

In [15]:
l1=[1,2,3,4]
df=pd.DataFrame(l1)
print(df)

   0
0  1
1  2
2  3
3  4

In [16]:
type(df)

pandas.core.frame.DataFrame

In [18]:
l2=[[1,2,3,4],[5,6,78,7]]
df2=pd.DataFrame(l2)
print(df2)

   0  1   2  3
0  1  2   3  4
1  5  6  78  7

In [19]:
df2.index

RangeIndex(start=0, stop=2, step=1)

In [21]:
df.columns   ## to fetch only columns

RangeIndex(start=0, stop=4, step=1)

In [22]:
## create a dataframe with index and column
l2=[[1,2,3,4],[5,6,78,7]]
df2=pd.DataFrame(l2,index=["a","b"],columns=["a","b","c","d"])
print(df2)

   a  b   c  d
a  1  2   3  4
b  5  6  78  7

## Dealing with rows

## rows selection

### fetch top 5 rows

In [28]:
data={"country":["india","uk","austria","us","canada","pakistan"],"GDP":[123,123,678,2134,3456,232],"country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(data)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [29]:
df.head()

   country   GDP country_type
0    india   123   developing
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [30]:
df.tail()  ## to fetch bottom 5

    country   GDP country_type
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

## iloc()-integer based and loc()

In [32]:
df.iloc[3]  #series

country                us
GDP                  2134
country_type    developed
Name: 3, dtype: object

In [33]:
df.iloc[-1]

country           pakistan
GDP                    232
country_type    developing
Name: 5, dtype: object

In [34]:
df.iloc[0:5:2] #dataframe

   country   GDP country_type
0    india   123   developing
2  austria   678    developed
4   canada  3456    developed

In [35]:
df.iloc[2:5]

   country   GDP country_type
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [36]:
df.iloc[[1,3,5]]  ## to fetch specific rows-discontinuous manner use [[]]

    country   GDP country_type
1        uk   123    developed
3        us  2134    developed
5  pakistan   232   developing

In [37]:
df.iloc[:,2]  ##all rows and 2 col use single sq bracket only

0    developing
1     developed
2     developed
3     developed
4     developed
5    developing
Name: country_type, dtype: object

In [39]:
df.iloc[:,1:]

    GDP country_type
0   123   developing
1   123    developed
2   678    developed
3  2134    developed
4  3456    developed
5   232   developing

In [43]:
df.iloc[[2,4],[0,2]]

   country country_type
2  austria    developed
4   canada    developed

## loc()-for string

In [44]:
df.iloc[:,"country_type"] ## use loc for string data base

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [45]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

## to make any col index use set_index

In [46]:
df.set_index(df["country"],inplace=True)
df

           country   GDP country_type
country
india        india   123   developing
uk              uk   123    developed
austria    austria   678    developed
us              us  2134    developed
canada      canada  3456    developed
pakistan  pakistan   232   developing

In [47]:
df.index

Index(['india', 'uk', 'austria', 'us', 'canada', 'pakistan'], dtype='object', name='country')

In [48]:
df.columns

Index(['country', 'GDP', 'country_type'], dtype='object')

In [49]:
df.drop(columns=["country"],inplace=True)

In [50]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [51]:
df.loc["uk"]

GDP                   123
country_type    developed
Name: uk, dtype: object

In [52]:
df.loc["uk":"pakistan"]

           GDP country_type
country
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

## iloc exclude last index value while loc include the last element

In [53]:
df.loc[["uk","canada"]]

          GDP country_type
country
uk        123    developed
canada   3456    developed

In [54]:
df.loc[:,["GDP"]]

           GDP
country
india      123
uk         123
austria    678
us        2134
canada    3456
pakistan   232

## reset index

In [55]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [56]:
df.reset_index(inplace=True)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

# 07/11/22

## append()-addition of new rows to the data frame

### add the rows of one data frame to the target dataframe at the end

In [3]:
import pandas as pd
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2']) 
print(d)

   x   y
0  7   8
1  9  10

In [4]:
print(d2)

    1   2
0  11  12

In [7]:
d=d.append(d2)   ##use concat to add the rows, that's why this warning is showing
d

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\1274138650.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d=d.append(d2)   ##use concat to add the rows, that's why this warning is showing

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
0  NaN   NaN  11.0  12.0
0  NaN   NaN  11.0  12.0

#### compatiable issue bcz of column names not bcz of elements or size

In [8]:
d1=d.append(d2,ignore_index=True)  ## use ignore_index for index
d1

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\2417568729.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1=d.append(d2,ignore_index=True)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
2  NaN   NaN  11.0  12.0
3  NaN   NaN  11.0  12.0
4  NaN   NaN  11.0  12.0

In [9]:
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])  
d1 = d.append(d2)  
d1

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\625284517.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1 = d.append(d2)

    x   y
0   7   8
1   9  10
0  11  12
1   2   3

In [10]:
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])  
d1 = d.append(d2,ignore_index=True)  
d1

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\3080471656.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1 = d.append(d2,ignore_index=True)

    x   y
0   7   8
1   9  10
2  11  12
3   2   3

In [11]:
d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
df1=pd.DataFrame(d1)
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76

#### to add in between rows use iloc or loc, append and concat add at the end

In [12]:
df1.iloc[2]=["thomas",89,85]
df1

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2   thomas     89       85
3  Georgia     95       76

In [14]:
df1.iloc[1:3]=[["heena",58,99],["heemani",78,58]]   ##update the rows-iloc
df1

      Name  Maths  Science
0   Martha     87       83
1    heena     58       99
2  heemani     78       58
3  Georgia     95       76

In [15]:
df1["Name"].iloc[0]="viv"  ##to update particular col not whole row
df1

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\3844595206.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["Name"].iloc[0]="viv"  ##to update particular col not whole row

      Name  Maths  Science
0      viv     87       83
1    heena     58       99
2  heemani     78       58
3  Georgia     95       76

In [16]:
df1.set_index("Name",inplace=True)
df1

         Maths  Science
Name
viv         87       83
heena       58       99
heemani     78       58
Georgia     95       76

In [17]:
df1.loc["jai"]=[23,45]
df1

         Maths  Science
Name
viv         87       83
heena       58       99
heemani     78       58
Georgia     95       76
jai         23       45

In [18]:
df1.reset_index(inplace=True)
df1

      Name  Maths  Science
0      viv     87       83
1    heena     58       99
2  heemani     78       58
3  Georgia     95       76
4      jai     23       45

#### D/B them-iloc- update or replace but it will not add new row, loc will do that (we can expand and update in loc)

In [20]:
df1.iloc[5]=["sis",56,78]
df1

IndexError: iloc cannot enlarge its target object

## Row Deletion-use when nan value or duplicate row is there

In [21]:
df1

      Name  Maths  Science
0      viv     87       83
1    heena     58       99
2  heemani     78       58
3  Georgia     95       76
4      jai     23       45

In [24]:
df1.drop(1,inplace=True)   ##no need to give inplace in row deletion its already given

KeyError: '[1] not found in axis'

In [25]:
df1

      Name  Maths  Science
0      viv     87       83
2  heemani     78       58
3  Georgia     95       76
4      jai     23       45

In [26]:
df1 = pd.DataFrame([[4, 5], [6, 7]], columns = ['x','y'])  
df1

   x  y
0  4  5
1  6  7

In [27]:
df1=df1.drop(1)
df1

   x  y
0  4  5

In [28]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [30]:
df=df.drop(index=df.index[0:6:2])  #delete every alternate rows
df

    state  population state_region
1  gujrat          80         west
3     goa          10        south
5  sikkim          30         east

In [32]:
df=df.drop(index=[1,4],inplace=True)  #delete specific rows
df

KeyError: '[4] not found in axis'

## column selection

In [34]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [35]:
df["state"]

0     delhi
1    gujrat
2        up
3       goa
4        mp
5    sikkim
Name: state, dtype: object

In [36]:
df[["state","state_region"]]

    state state_region
0   delhi        north
1  gujrat         west
2      up        north
3     goa        south
4      mp        south
5  sikkim         east

In [37]:
df.drop(columns="state",inplace=True)
df

   population state_region
0          90        north
1          80         west
2          70        north
3          10        south
4          34        south
5          30         east

##  column rename()

In [40]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [41]:
df.rename(columns={"state":"country_state"},inplace=True)
df

  country_state  population state_region
0         delhi          90        north
1        gujrat          80         west
2            up          70        north
3           goa          10        south
4            mp          34        south
5        sikkim          30         east

## column reordering

In [43]:
df=df[["population","country_state","state_region"]]
df

   population country_state state_region
0          90         delhi        north
1          80        gujrat         west
2          70            up        north
3          10           goa        south
4          34            mp        south
5          30        sikkim         east

In [45]:
## to change all columns
df.columns=["p","s","r"]
df

    p       s      r
0  90   delhi  north
1  80  gujrat   west
2  70      up  north
3  10     goa  south
4  34      mp  south
5  30  sikkim   east

## column addition

In [46]:
### addition of new columns
l=[]
for i in df["p"]:    ## loop on a particular column
    l.append(i*i)
l

[8100, 6400, 4900, 100, 1156, 900]

In [48]:
s=pd.Series(l)
s

0    8100
1    6400
2    4900
3     100
4    1156
5     900
dtype: int64

In [49]:
type(s)

pandas.core.series.Series

In [50]:
df["p_square"]=s
df

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\2688551004.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["p_square"]=s

    p       s      r  p_square
0  90   delhi  north      8100
1  80  gujrat   west      6400
2  70      up  north      4900
3  10     goa  south       100
4  34      mp  south      1156
5  30  sikkim   east       900

## extracting the column names of particular type

In [51]:
df.dtypes

p            int64
s           object
r           object
p_square     int64
dtype: object

In [52]:
df.select_dtypes(include=object)

        s      r
0   delhi  north
1  gujrat   west
2      up  north
3     goa  south
4      mp  south
5  sikkim   east

In [53]:
## column names of these

In [54]:
df.select_dtypes(include=object).columns

Index(['s', 'r'], dtype='object')

In [55]:
df["p"]=df["p"].astype("float")

C:\Users\rupan\AppData\Local\Temp\ipykernel_33740\1910986187.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["p"]=df["p"].astype("float")

In [56]:
df.dtypes

p           float64
s            object
r            object
p_square      int64
dtype: object

In [57]:
numeric=["float","int"]
df.select_dtypes(include=numeric)

      p  p_square
0  90.0      8100
1  80.0      6400
2  70.0      4900
3  10.0       100
4  34.0      1156
5  30.0       900

# creating series()

In [58]:
## creating series from array
import numpy as np
data=np.array(['g','e','e','k','s'])
ser1=pd.Series(data)
ser1

0    g
1    e
2    e
3    k
4    s
dtype: object

In [16]:
data=np.array(['g','e','e','k','s'])
ser1=pd.Series(data)
ser1

0    g
1    e
2    e
3    k
4    s
dtype: object

In [62]:
l=[["a","b","c"],["aa","bb","cc"]]
ser1=pd.Series(l)
print(ser1)
print(type(ser1))

0       [a, b, c]
1    [aa, bb, cc]
dtype: object
<class 'pandas.core.series.Series'>

## creating series from tuple

In [63]:
tu=tuple(range(1,10))
s=pd.Series(tu)
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

## from dict

In [64]:
d={"a":10,"b":20,"c":30}
s=pd.Series(data=d)   ##always pass in data
s

a    10
b    20
c    30
dtype: int64

In [65]:
d={"a":10,"b":20,"c":30}   ##keys are index in dict
s=pd.Series(d)   
s

a    10
b    20
c    30
dtype: int64

In [66]:
ser1=pd.Series(data=d,index=['x','y','z'])  ## gives null value bcz of mismatched index in case of dict
ser1

x   NaN
y   NaN
z   NaN
dtype: float64

In [73]:
k=ser1.reset_index() ##resetting index in case of dict
k

  index   0
0     x NaN
1     y NaN
2     z NaN

In [74]:
k.drop(columns=[0],inplace=True)
k

  index
0     x
1     y
2     z

## create a series using scalar

In [78]:
x=pd.Series(4,index=[0,1,2,3])
print(x)

0    4
1    4
2    4
3    4
dtype: int64

In [76]:
x=pd.Series(4)
print(x)

0    4
dtype: int64

In [79]:
x.shape

(4,)

In [80]:
## fetching particular rows, there is only one col in series
x=pd.Series([1,2,3,4],index=["a","b","c","d"])
x["d"]

4

In [81]:
date=pd.date_range("1/1/2000",periods=12)  ## date range is a pandas function to generate dates 
date

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10', '2000-01-11', '2000-01-12'],
              dtype='datetime64[ns]', freq='D')

In [82]:
x1=pd.DataFrame(date,columns=["dates"])
x1

        dates
0  2000-01-01
1  2000-01-02
2  2000-01-03
3  2000-01-04
4  2000-01-05
5  2000-01-06
6  2000-01-07
7  2000-01-08
8  2000-01-09
9  2000-01-10
10 2000-01-11
11 2000-01-12

In [83]:
## task: add a new column to this data frame

In [85]:
s=np.arange(12)
s

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11])

In [89]:
x1["newcol"]=pd.Series(s)
x1

        dates  newcol
0  2000-01-01       0
1  2000-01-02       1
2  2000-01-03       2
3  2000-01-04       3
4  2000-01-05       4
5  2000-01-06       5
6  2000-01-07       6
7  2000-01-08       7
8  2000-01-09       8
9  2000-01-10       9
10 2000-01-11      10
11 2000-01-12      11

In [90]:
## make dates index-use set_index

In [91]:
x1.set_index(x1["dates"],inplace=True)
x1

                dates  newcol
dates
2000-01-01 2000-01-01       0
2000-01-02 2000-01-02       1
2000-01-03 2000-01-03       2
2000-01-04 2000-01-04       3
2000-01-05 2000-01-05       4
2000-01-06 2000-01-06       5
2000-01-07 2000-01-07       6
2000-01-08 2000-01-08       7
2000-01-09 2000-01-09       8
2000-01-10 2000-01-10       9
2000-01-11 2000-01-11      10
2000-01-12 2000-01-12      11

In [98]:
x1.drop(columns=["dates"],inplace=True)

In [99]:
x1

            newcol
dates
2000-01-01       0
2000-01-02       1
2000-01-03       2
2000-01-04       3
2000-01-05       4
2000-01-06       5
2000-01-07       6
2000-01-08       7
2000-01-09       8
2000-01-10       9
2000-01-11      10
2000-01-12      11

In [100]:
x1.reset_index(inplace=True)

In [101]:
x1

        dates  newcol
0  2000-01-01       0
1  2000-01-02       1
2  2000-01-03       2
3  2000-01-04       3
4  2000-01-05       4
5  2000-01-06       5
6  2000-01-07       6
7  2000-01-08       7
8  2000-01-09       8
9  2000-01-10       9
10 2000-01-11      10
11 2000-01-12      11

## we will not use inplace in series